In [7]:
%load_ext sql
%sql mysql+mysqlconnector://root:Sakthi@localhost/

In [8]:
%sql SHOW DATABASES

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [5]:
%%sql
USE sakila

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [6]:
%%sql
SELECT DATABASE();

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('sakila',)]

In [7]:
%%sql
SHOW TABLES

 * mysql+mysqlconnector://root:***@localhost/
23 rows affected.

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

In [9]:
%sql SHOW DATABASES

 * mysql+mysqlconnector://root:***@localhost/
6 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [10]:
%%sql
USE world;

SHOW TABLES;
DESCRIBE country;

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.
3 rows affected.
15 rows affected.

[('Code', 'char(3)', 'NO', 'PRI', '', ''),
 ('Name', 'char(52)', 'NO', '', '', ''),
 ('Continent', "enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America')", 'NO', '', 'Asia', ''),
 ('Region', 'char(26)', 'NO', '', '', ''),
 ('SurfaceArea', 'decimal(10,2)', 'NO', '', '0.00', ''),
 ('IndepYear', 'smallint', 'YES', '', None, ''),
 ('Population', 'int', 'NO', '', '0', ''),
 ('LifeExpectancy', 'decimal(3,1)', 'YES', '', None, ''),
 ('GNP', 'decimal(10,2)', 'YES', '', None, ''),
 ('GNPOld', 'decimal(10,2)', 'YES', '', None, ''),
 ('LocalName', 'char(45)', 'NO', '', '', ''),
 ('GovernmentForm', 'char(45)', 'NO', '', '', ''),
 ('HeadOfState', 'char(60)', 'YES', '', None, ''),
 ('Capital', 'int', 'YES', '', None, ''),
 ('Code2', 'char(2)', 'NO', '', '', '')]

In [13]:
%sql SHOW TABLES;

 * mysql+mysqlconnector://root:***@localhost/
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

In [14]:
%%sql
CREATE DATABASE college;
USE college;
SELECT DATABASE();

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.
0 rows affected.
1 rows affected.

[('college',)]

In [15]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/
7 rows affected.

[('college',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [16]:
%%sql
use world

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [17]:
%%sql
use college

 * mysql+mysqlconnector://root:***@localhost/
0 rows affected.

[]

In [18]:
%%sql
select database();

 * mysql+mysqlconnector://root:***@localhost/
1 rows affected.

[('college',)]

In [24]:
%%sql
create tablE stud (id INT PRIMARY KEY , NAME VARCHAR(100) , PHONE INT);

 * mysql+mysqlconnector://root:***@localhost/
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'stud' already exists
[SQL: create tablE stud (id INT PRIMARY KEY , NAME VARCHAR(100) , PHONE INT);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [26]:
%%sql
INSERT INTO STUD ( ID , NAME , PHONE) VALUES ( 1 , "SA" , 3444 ),(2 , "GH", 7890);
SELECT * FROM STUD;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.
2 rows affected.

[(1, 'SA', 3444), (2, 'GH', 7890)]

In [27]:
%%sql
SELECT * FROM stud;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'SA', 3444), (2, 'GH', 7890)]

In [35]:
%%sql
select id name, phone  from stud;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 3444), (2, 7890)]

In [40]:
%%sql
insert into stud ( id , name )values ( 3 , "sak" ) , (4,"uuu");
select * from stud;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.
4 rows affected.

[(1, 'SA', 3444), (2, 'GH', 7890), (3, 'sak', None), (4, 'uuu', None)]

In [39]:
%%sql
SELECT * FROM stud;

 * mysql+mysqlconnector://root:***@localhost/
2 rows affected.

[(1, 'SA', 3444), (2, 'GH', 7890)]

In [49]:
%%sql 
update stud set name = "gowtham" ;

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[]

In [50]:
%%sql 

select * from stud

 * mysql+mysqlconnector://root:***@localhost/
4 rows affected.

[(1, 'gowtham', 3444),
 (2, 'gowtham', 7890),
 (3, 'gowtham', None),
 (4, 'gowtham', None)]